{"_id":"SCHEDULE","_rev":"42-ac1b5169fa885f6477af608e2133853c","TRACK_A":{"sat":[{"begin":"9:00","end":"9:45","name":"Douglas Crockford","title":"Really, JavaScript?"},{"begin":"9:45","end":"10:00","name":"Michael Erlewine","title":"Mozilla's JetPack"},{"begin":"10:00","end":"10:45","name":"Ben Galbraith, Dion Almaer, Matt McNulty","title":"Solving Device Fragmentation: How Do You Support 12,320 Different Mobile Platforms?"},{"begin":"10:45","end":"11:00","name":"Break","type":"break"},{"begin":"11:00","end":"11:45","name":"Francisco Tolmasky","title":"Socratic: Documentation Done Right"},{"begin":"11:45","end":"12:30","name":"Jenn Lukas","title":"JavaScript and Web Standards Sitting in a Tree"},{"begin":"12:30","end":"13:30","name":"Mozilla's YayQuery Lunch Special","type":"break"},{"begin":"13:30","end":"14:15","name":"Ryan Dahl","title":"Less is More in Node.js"},{"begin":"14:15","end":"15:00","name":"Tobias Schneider","title":"Flash is dead, long live Flash!"},{"begin":"15:00","end":"15:15","name":"Snack Break","type":"break"},{"begin":"15:15","end":"16:00","name":"Aaron Newton","title":"Programming To Patterns"},{"begin":"16:00","end":"16:30","name":"Tom Hughes-Croucher","title":"Piratin' the YQL way"},{"begin":"16:30","end":"17:15","name":"Aaron Quint","title":"The front-end takeover or how to use Sammy.js to stop writing server side code"}],"sun":[{"begin":"9:00","end":"9:45","name":"Charles Jolley","title":"SproutCore 1.1: Even Faster HTML5 Apps (in less time)"},{"begin":"9:45","end":"10:30","name":"Dmitry Baranovskiy","title":"Raphaël the Great"},{"begin":"10:30","end":"11:00","name":"CommonJS Panel Discussion","title":"JavaScript Outside of the Browser - Where it is and where it's going!"},{"begin":"11:00","end":"11:45","name":"Makinde Adeagbo","title":"Primer: Facebook's 2k of JavaScript to power (almost) all interactions"},{"begin":"11:45","end":"12:30","name":"John-David Dalton","title":"All you can leet - Coding for performance, CSS engines, and sandboxed natives"},{"begin":"12:30","end":"13:30","name":"Mozilla's Red Plate Lunch Special","type":"break","title":"Relax, Recover, Refuel!"},{"begin":"13:30","end":"14:15","name":"Felix Geisendoerfer","title":"Dirty NoSQL"},{"begin":"14:15","end":"14:45","name":"Jupiter Consulting","title":"Enterprise JavaScript"},{"begin":"14:45","end":"15:30","name":"Steve Souders","title":"The Best Of Steve"},{"begin":"15:30","end":"16:15","name":"ScurvyConf Master","title":"The crowd favorite from ScurvyConf"},{"begin":"16:15","end":"16:30","name":"Snack Break","type":"break","title":"Activating Caffeine Powers!"},{"begin":"16:30","end":"17:15","name":"Billy Hoffman","title":"JavaScript's Evil Side"},{"begin":"17:15","end":"18:00","name":"Brendan Eich","title":"An Introduction to JavaScript"},{"begin":"18:00","end":"18:45","name":"Alex Russell","title":"Google Chrome Frame"}]},"TRACK_B":{"sat":[{"begin":"9:00","end":"9:30","name":"Chris Williams","description":"And why you should do the same. The revolution is started by people like you come be inspired","title":"How I Pulled off JSConf"},{"begin":"9:30","end":"10:00","name":"Brian Mitchell","description":"Im going to give a crash course on Lua for JavaScript developers. Ill show whats awesome about Lua and hopefully demo LuaJIT smashing V8 into tiny pieces. You will walk away a polyglot by the end of it and hopefully appreciate how well these two languages go together.","title":"JavaScript's Twin"},{"begin":"10:00","end":"10:30","name":"Jeremy Ashkenas","description":"Ever wanted to change the way that JavaScript works Learn about the internals of CoffeeScript and tricks for building a self-compiled language of your own.","title":"A Cup of CoffeeScript"},{"begin":"10:30","end":"11:00","name":"Nikolai Onken","description":"As web developers and JavaScript pirates we often forget what potential the browser as a platform can bring us - shouldnt there be more communication channels possible than talking to webservices How about connecting your browser to real hardware (yargh imagine reading the speeds of wind in your browser)\nThe browser is the best platform for rapidly building UIs and once we can access hardware (through bluetooth for instance) we can start building applications we never though we could.\nIn this talk I will demonstrate how to prototype an application for the iPhone which connects to hardware through the browser - real JavaScript hackery ftw.","title":"The browser controlling hardware real pirate hackery"},{"begin":"11:00","end":"11:30","name":"Zach Carter","description":"You know you always wanted to.","title":"Build your own programming language with JavaScript"},{"begin":"11:30","end":"12:00","name":"Michael Mahemoff","description":"What a wonderfully twisted world we unearth when we burrow into the world of single page applications. These unusual applications run off the file system using file URIs and moreover they also save to the file using a range of browser hacks. The best-known example is TiddlyWiki and TiddlyWiki-derived apps are the basis for these discoveries. Once you decide to store every bit of logic and user content in a single file interesting questions arise. How do you embed images SVG And the hacks go on ... iFrame sandboxing making a chameleon file that is both valid HTML and valid Javascript more. This talk will outline the hacks and identify potential applications.","title":"The Lost Hacks Ridiculous Browser Tricks from the World of Single-Page Applications "},{"begin":"12:00","end":"12:30","name":"Paul Irish","description":"The battle to implement HTML5 and CSS3 is fraught with landmines boobytraps outdated specs and of course Internet Explorer.  JavaScript is a potent weapon to wield but only once you are trained in the arts of Progressive Enhancement and Feature Detection can you conquer these beasts cross-browser.  Add treasures such as localStorage video and 3D transforms to your booty today and dazzle your users - without blowing them up  \n\nBullet points nay. Cannon balls matey.\n Look through thar performance periscope at HTML5 Drag n Drop vs draggable(). CSS Transitions vs animate()\n What is thar performance delta of CSS3 vs. IE filters \n How cross-browser be these Do I tempt Davy Jones locker\n How t take advantage of graceful degredation by default in CSS3 but catch unsupportin browsers by th toes\n Detaild fallbacks fer each feature Geolocation normalization shadows corners etc\n Making IE8 Compatibility mode walk th plank\n Yonder most clever uses of these technologies seen thus far in th real-world.\n A proven treasure map to get clients on your side and demand that not all browsers are equal or else\n\nJoin capn Paul Irish to navigate these thrashing waters.","title":"Progressive Advancement on the High Seas of Web8"},{"begin":"12:30","end":"13:30","name":"Mozilla's YayQuery Lunch Spectacular","type":"break"},{"begin":"13:30","end":"14:00","name":"Nikolai Onken and Tobias von Klipstein","description":"Writing apps for mobile devices is a pain when you need to write them in the native language of each device. The term HTML5 Apps tries to coin the idea of writing apps with the web technology stack just once making them available through app stores or through the web and deploying them to several mobile platforms. In this talk you will hear about the challenges and solutions of cross-platform mobile app development the different widget runtimes the W3C Widget standard the JIL and BONDI specification and of course about PhoneGap.","title":"What the heck are HTML5 Apps"},{"begin":"14:00","end":"14:30","name":"John Resig","description":"JavaScript libraries are popular today due to two main reasons To work around browser incompatibilities and to work around the convoluted DOM API. This talk will outline a new proposal for a better DOM API centered around NodeLists that is easy to use fast and secure.","title":"Call for a better DOM API"},{"begin":"14:30","end":"15:00","name":"Kevin Dangoor Patrick Walton","description":"Bespin is an in-browser code editor that is completely extensible via JavaScript plugins. You can use it in the cloud or embed the editor in your own apps. Its built on the emerging HTML5 specs that are supported by the major leading edge browsers. In fact the editor itself is actually drawn on canvas elements. In this talk well show what its like to work with and extend Bespin and dive into some of the interesting things going on under the hood. Ill also touch on SproutCore a bit as Bespin is built on top of SproutCore.\n","title":"Bespin the extensible in-browser code editor"},{"begin":"15:00","end":"15:15","name":"Snack Break","type":"break"},{"begin":"15:15","end":"15:45","name":"Jed Schmidt","description":"Not content to be another Sinatra clone (fab) is a micro-framework that leverages the good parts of Javascript to create a mind-bendingly modular and concise way to build web apps. In this talk (fab) author Jed Schmidt explains how to take advantage of (fab)s combination of function chaining and unified http-all-the-way-down approach to build apps optimized on clarity and reuse.","title":"A (fab) approach to web apps"},{"begin":"15:45","end":"16:15","name":"Jeffrey Van Gogh","description":"Last fall the Cloud Programmability team @ Microsoft released Reactive Extensions (Rx) for .NET. Rx is a library that allows programmers to write succinct declarative code to orchestrate and coordinate asynchronous and event-based programs based on familiar .NET idioms and patterns. This spring the team is releasing a JavaScript port of Rx. Jeff will show you how to get started with RxJs how to use Rx with other JavaScript libraries as well as show some of the fundamental concepts behind Rx.","title":"The Reactive Extensions for JavaScript"},{"begin":"16:15","end":"16:45","name":"F1LT3R","description":"Strap yourself in and get ready for PURE WEBGL DEMO AWESOMENESS to be fired directly at your visual cortex. Followed by a quick tutorial demonstrating the simplicity of using Processing.js to leverage WebGL in future browsers. EPILEPSY WARNING chance of seizure moderate to likely.","title":"WebGL Demo Overload"},{"begin":"16:45","end":"17:15","name":"Matthew Fowle","description":"Server side JavaScript and HTML5 to build a better real time web transport and dodge the two connection limit.","title":"Laying New Web Infrastructure"}],"sun":[{"begin":"9:00","end":"9:30","name":"Jonathan Julian","description":"Lets ease into day 2 with a nice calm session. Nothing here will be too difficult or mind-bending because thats not what you need right now. You need coffee a dimly-lit room some breakfast and some simple explanations to some common solutions with jQuery.\n\n1. Build your own lightbox. In less than 20 lines of code well be showing a login form in a nice lightbox.\n\n2. Textarea character counter. Like the twitter home page see how simple it is to build a characters-remaining counter alongside your text fields. Unobtrusively of course.\n\n3. Ajax-ifying your forms. Unobtrusively add Ajax submit to your forms with jquery.form ensuring that they still work for non-js clients and errors are properly relayed.\n","title":"Hangover.js"},{"begin":"9:30","end":"10:00","name":"Shea Frederick","description":"No fancy animations or flash like effects this is just about how to deal with clients that decide to redesign the entire UI of their web app when its 90 done and how to handle that disaster with ease in Ext JS. ","title":"Ext JS App UI Morphing"},{"begin":"10:00","end":"10:30","name":"Kyle Simpson","description":"What sits between the front-end and the back-end of a web application The middle-end of course You know the UI architecture which includes templating data validation data formatting url routing build-time optimizations (concatenation compression) caching etc.\n\nBut have you ever been frustrated by the fact that you usually have little to no control over this part of your application Typical MVC implementations just arent flexible enough.\n\nCome learn a new UI-centric application design pattern called CVC (Client-View-Controller) and how to use JavaScript in both browser and server to write code once (DRY) and power your entire UI architecture.","title":"Dude wheres my UI Architecture"},{"begin":"10:30","end":"11:00","name":"Adam Moore","description":"Explore event-driven application design with YUI 3.","title":"Interesting Moments - Working with the YUI 3 Event System"},{"begin":"11:00","end":"11:30","name":"Dean Landolt","description":"I be presenting me treasure map to an AAAR-rated booty of data persistence and management techniques -- pintura and perstore.\n\nOn the map be saavy crosscutting AOP and swashbucking decorations for ye models.\n\nBe ye an old salt on the H.M.S. SQL a nosql seadog or a landlubbin lass green to databases ye wont be disappointed.\n\npiratespeak\n\nIll introduce the perstore storemodelfacet architecture and its uniform interface get query put post delete and how it all maps to your HTTP requests.\n\nIll demonstrate how to use these methods to interact with your objects and their lifecycles.\n\nFinally Ill talk about the fun you can have with decorators -- wrapping stores (to get notifications or adaptive indexing for instance) models (to mix in new structure and behavior) and the application itself (using JSGI middleware to rape and pillage your requestresponse cycle as needed).\n","title":"Pintura Perstore and Awesome-Oriented Persistence"},{"begin":"11:30","end":"12:00","name":"Suvajit Gupta","description":"Don't even think of calling it Enterprise, this is the new JavaScript word!","title":"Colossal JavaScript"},{"begin":"12:00","end":"12:30","name":"Malte Ubl","description":"One of the most beautiful aspects of the Open Web (TM) is that you can go to a web page and hit view source to find out how it does all the client side magic. Not few of us learned programming that way. Admittedly, viewing source got a little harder through things like JavaScript minification. In this session we'll look at the deobfuscated source of some of the most interesting web properties to see how they do stuff. At least one of our victims tried really hard to keep their source private (thus the weird name of this talk :).","title":"JavaScript - The Private Parts"},{"begin":"12:30","end":"13:30","name":"CommonJS Lunch Forum","type":"break"},{"begin":"13:30","end":"14:00","name":"David Furfero","description":"Get those naughty asynchronous XHRs in line with Sexy the hottest way to do Sequential Ajax (Sajax) - simultaneous requestsequential response. Sexy helps you bootstrap your app bind your data and bundle your code with sticky sweet syntax.","title":"Sexy.js Boots Bundles  Binding"},{"begin":"14:00","end":"14:30","name":"Rob Tsuk","description":"When Palm started building webOS a few years back there was a lot of pioneering work to be done. How do you go about building applications using the Web stack on mobile touch input devices How do we tie into the unique experience that mobile devices offer and break out of the Web sandbox \n\nIn this technical presentation we will we explore the Mojo framework that powers many of the applications on webOS. We open a dialogue to reveal and debunk Not only will you walk away understanding the issues behind building web apps for mobile but you will also learn about the design considerations that we made along the way as we pushed the Web in directions it wasnt quite going in yet.  We have more work to do and more to talk about. We hope to have a conversation about where we go from here as we continue to move from Web pages to complex rich Web applications. \n","title":"Mojo Developing and building a touch UI framework for mobile using the Web"},{"begin":"14:30","end":"15:00","name":"Gonzalo Cordero","description":"Walk through to demonstrate how easy and quick is to start building extensible robust and scaleable modules using YUI3.","title":"YUI3 - Creating modules using YUI"},{"begin":"15:00","end":"15:30","name":"Alexandre Morgaut","description":"Wakanda is an integrated JavaScript platform providing developers all the tools necessary to build fast powerful business applications  from client to server  using a revolutionary new business object data store. Ill show how all the pieces fit together and how developers can take advantage of this new paradigm.","title":"Taking over the enterprise one hook at a time"},{"begin":"15:30","end":"16:00","name":"Jan Lehnardt","description":"Im showing off @jchris evently framework that allows you to build wicked fast event driven two-tier (look ma no rails or django) HTML5 applications with CouchDB.","title":"Evently Declarative CouchDB Applications that practically write themselves"},{"begin":"16:00","end":"16:30","name":"Brian LeRoux","description":"Lets kick it and mess around with PhoneGap XUI and Lawnchair. ","title":"PhoneGap Hack Around"},{"begin":"16:30","end":"17:00","name":"Snack Break","type":"break"},{"begin":"17:00","end":"17:30"},{"begin":"17:30","end":"18:00","name":"RayMorgan","description":"Templates are annoying. They are especially annoying when you are dealing with markup littered with logic. Mustache simplifies your life (and templates) by removing the logic from the templates.\n\nThis talk will cover what Mustache is Mustache.js and Mu (for Node.js).","title":"Mustache is simplifying your templates"},{"begin":"18:00","end":"18:30","name":"Brian LeRoux ","description":"JavaScript has awkward moments. Hilarity ensues.","title":"best of wtfjs"}]}}